package object;
/*
    类和对象

     什么是对象？
         万物皆对象，客观存在的事物皆为对象
     什么是类？
         类是对现实生活中一类具有共同属性和行为的事物的抽象

         类的特点：
            1.类是对象的数据类型
            2.类是具有相同属性和行为的一组对象的集合

     类和对象的关系？
          类：类是对现实生活中一类具有共同属性和行为的事物的抽象
         对象：是能够看得到摸得着的真实存在的实体
              类是对象的抽象，对象是类的实体

      类的定义：
         类的重要性：是Java程序的基本组成单位
      类的组成：属性和行为
         属性：在类中通过成员变量来体现（类中方法外的变量）
         行为：在类中通过成员方法来体现（和前面的方法相比去掉static关键字即可）

         每个方法调用完过后都会从栈内存消失
         成员变量都具有默认值，同数组默认值规则

        *******当两个对象的地址值相同时（即指向相同时），一个对象修改其堆内存的值(成员变量值)过后，另一个对象在访问的时候数据也是改变过的
     */

public class Heima29 {

}
